import random
"""
Настройки лошади
"""


def name_horse():
    """
    Список имен лошадей.
    Генерирует случайное имя из списка
    """
    name_horse_list = ["Mr.Putin", "Абрамович", "РосКосмос", "Covid", "Санкции", "Мама Стифлера", "ЯжМать",
                       "Белый Орёл", "Тандем", "ПуМеСлава", "Дед Кожугет", "Авто ВАЗ", "Игорь Николаев",
                       "Парнас", "Сын Маминой Подруги", "Лепс", "3-е Сентября", "UBER", "Скотч", "Перец",
                       "В.И. Ленин", "Навальный", "Solana", "Офелия", "МФЦ", "ДомКлик", "Дикси", "ЕГЭ",
                       "Обнуление", "Пересельд в Космосе", "Крепкий Орешек", "Крепкий Орешек 2",
                       "Первая годовщина СВО", "Трамп в Твитере", "Джейн Псаки", "Спиро Наполнасракис",
                       "Оливье-Жюй да Глотай", "Поджог Сараев", "Рекорд Надоев", "Рулон Обоев", "Улов Hалимов",
                       "Распил Бюджетов", "Сосиска", "Сгорел Сарай ...", "Cucumber", "Риформа Абразавания",
                       "Грета Тунберг", "Шелдон Купер", "Света из Иваново", "Джигурда", "Ля ты крыса",
                       "пр. Задов", "Доллар 30", "Евро 40", "S как доллар", "Лёня Голубков", "Синус числа Пи",
                       "Петров и Баширов", "Успешный Успех", "Сосули", "Икра Красная", "Икра Чёрная", "Икра",
                       "Единая Россия", "Самка Богомола", "Валька- Стакан", "Леонид", "Акакий", "Егорка",
                       "Усы Пескова", "Лохматый Чебурашка", "Эльвира Сахипзадовна",
                       "МарсиАпельсин", "Кот-Бегемот", "Пони-Пельмень", "Аквамарин", "Астрал", "Бестиарий",
                       "Ваниллиум", "Галактион", "Дельфиний", "Единорог", "Жемчужина", "Зефир", "Импульс",
                       "Квантум", "Комет", "Луноход", "Марсианин", "Нептун", "Орион", "Пегас", "Радужный",
                       "Сатурн", "Солнечный Луч", "Океаниум", "Ветрокрыл", "Звездопад", "Лунный Свет",
                       "Солнечное Сияние", "Мореплаватель", "Покоритель Небес", "Мечтатель",
                       "Ночная Тень", "Утренняя Роса", "Первопроходец", "Волшебный Лес",
                       "Сказочная Страна", "Загадочный Остров", "Бескрайнее Небо",
                       "Бесконечная Любовь", "Вечная Молодость", "Непобедимый Герой",
                       "Быстроногий Олень", "Неуловимая Птица"]
    name_horse_random = random.choice(name_horse_list)
    name_horse_list.remove(name_horse_random)
    return str(name_horse_random)


def power_horse():
    """
    Сила лошади (как долго может бежать с максимальной скоростью)
    """
    return random.randint(50, 150)


def max_speed_horse():
    """
    Скорость лошади (максимальная)
    """
    return random.randint(70, 120)
