import random
"""
Настройки лошади
"""
def name_horse():
    """
    Список имен лошадей
    Генерирует случайное имя из списка
    """
    name_horse_list = ["Mr.Putin", "Абрамович", "РосКосмос", "Covid", "Санкции", "Мама Стифлера", "ЯжМать",
                       "Белый Орёл", "Тандем", "ПуМеСлава", "Дед Кожугет", "Авто ВАЗ", "Игорь Николаев",
                       "Парнас", "Сын Маминой Подруги", "Лепс", "3-е Сентября", "UBER", "Скотч", "Перец",
                       "В.И. Ленин", "Навальный", "Solana", "Офелия", "МФЦ", "ДомКлик", "Дикси", "ЕГЭ",
                       "Обнуление", "Пересельд в Космосе", "Крепкий Орешек", "Крепкий Орешек 2",
                       "Первая годовщина СВО", "Трамп в Твитере", "Джейн Псаки", "Спиро Наполнасракис",
                       "Оливье-Жюй да Глотай", "Поджог Сараев", "Рекорд Надоев", "Рулон Обоев", "Улов Hалимов",
                       "Распил Бюджетов", "Сосиска", "Сгорел Сарай ...", "Cucumber", "Реформа Абразавания",
                       "Грета Тунберг", "Шелдон Купер", "Света из Иваново", "Джигурда", "Ля ты крыса",
                       "пр. Задов", "Доллар 30", "Евро 40", "S как доллар", "Лёня Голубков", "Синус числа Пи",
                       "Петров и Баширов", "Успешный Успех", "Сосули", "Икра Красная", "Икра Чёрная", "Икра",
                       "Единая Россия", "Самка Богомола", "Валька- Стакан", "Леонид", "Акакий", "Егорка",
                       "Усы Пескова", "Лохматый Чебурашка", "Эльвира Сахипзадовна"]
    return str(random.choice(name_horse_list))

def power_horse():
    """
    Сила лошоди (как долго может бежать с максимальной скоростью)
    """
    return random.randint(50, 150)

def max_speed_horse():
    """
    Скорость лошоди (максимальная)
    """
    return random.randint(70, 120)
